{
    "videos": [
        {
            "course_name": "CSA Striking System",
            "video_name": "Advanced Combo Sequences 11-20 with Integrated Muay Thai Techniques",
            "focus": "Offensive",
            "types": [
                "Boxing Combinations",
                "Muay Thai Techniques"
            ],
            "disciplines": [
                "Boxing",
                "Muay Thai"
            ],
            "targets": [
                "Head",
                "Body",
                "Legs"
            ],
            "strategies": [
                "Expanding the fighter's striking repertoire with advanced boxing combinations that incorporate Muay Thai techniques for a more versatile offense.",
                "Building sequences that start with boxing combinations and end with Muay Thai weapons, allowing for creative and effective striking flows.",
                "Introducing variability in attacks to confuse opponents and create openings for significant strikes."
            ],
            "techniques": [
                {
                    "variation": "Jab, Cross, Jab with Kick",
                    "description": "A boxing sequence of jab, cross, jab, followed by a Muay Thai kick (leg, body, or head) to capitalize on the created openings."
                },
                {
                    "variation": "Cross, Jab, Cross with Opposite Kick",
                    "description": "This combination reverses the traditional jab, cross pattern and includes an opposite leg kick to exploit defensive gaps."
                }
            ]
        },
        {
            "course_name": "CSA Striking System",
            "video_name": "Course 3: Video 1",
            "focus": "Offensive",
            "types": [
                "Striking"
            ],
            "disciplines": [
                "Muay Thai",
                "MMA"
            ],
            "targets": [
                "Head",
                "Body"
            ],
            "strategies": [
                "Utilizing diagonal and upward elbows to penetrate the opponent's guard.",
                "Employing elbows to clear the guard and create openings for further strikes.",
                "Focusing on the angle and execution to maximize the cutting potential of elbows, leading to fight-ending injuries."
            ],
            "techniques": [
                {
                    "variation": "Lead Diagonal Elbow",
                    "description": "A sharp, angled strike designed to penetrate or bypass the guard and target the head or body.",
                    "timestamp": "00:44:23-00:49:20"
                },
                {
                    "variation": "Rear Diagonal Elbow",
                    "description": "Delivered from the rear hand, this elbow comes at a diagonal angle, ideal for creating cuts or breaking through defenses.",
                    "timestamp": "00:49:21-00:51:08"
                },
                {
                    "variation": "Lead Up Elbow",
                    "description": "An upward strike from the lead hand, targeting the chin or torso, effective for close-range combat.",
                    "timestamp": "00:53:04-00:53:25"
                },
                {
                    "variation": "Rear Up Elbow",
                    "description": "Similar to the lead up elbow, but delivered with more power from the rear, targeting the lower face or upper chest.",
                    "timestamp": "00:55:25-00:58:01"
                },
                {
                    "variation": "Lead Back Elbow",
                    "description": "A reverse elbow strike from the lead arm, useful for opponents coming in close or as a counter to a forward movement.",
                    "timestamp": "00:59:20-01:01:07"
                }
            ],
            "defensive": {
                "focus": "Defensive",
                "types": [
                    "Guard Penetration",
                    "Counter-Striking"
                ],
                "disciplines": [
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Head",
                    "Body"
                ],
                "strategies": {
                    "creating": "Using elbows to create defensive openings and counter opportunities.",
                    "disrupting": "Disrupting the opponent's attack rhythm with sharp elbow counters.",
                    "guarding": "Incorporating elbow strikes in defensive maneuvers to protect against incoming strikes."
                },
                "notes": "The correct posture and execution of elbow strikes are crucial to prevent self-injury and maximize impact on the opponent."
            },
            "transcript_reference": "00:00:06:09 - 00:02:28:15",
            "key_points": [
                "Elbows are crucial in Muay Thai and MMA for their effectiveness in close combat and their ability to cause significant damage.",
                "The diagonal, upward, and back elbow strikes are highlighted for their strategic application in breaking through defenses and creating openings.",
                "The importance of correct form, including the angle of attack and body positioning, to ensure maximum effectiveness and safety."
            ]
        },
        {
            "course_name": "CSA Striking System",
            "video_name": "Basic Number System for Strikes",
            "focus": "Offensive",
            "types": [
                "Punches",
                "Kicks",
                "Elbows",
                "Knees"
            ],
            "disciplines": [
                "Boxing",
                "Muay Thai",
                "MMA"
            ],
            "targets": [
                "Head",
                "Body",
                "Legs"
            ],
            "strategies": [
                "Facilitates memorization and quick recall during training and combat.",
                "Allows for the integration of feints within combinations.",
                "Enables the creation of fluid combinations using a mix of strikes."
            ],
            "techniques": [
                {
                    "variation": "Jab",
                    "description": "A quick, straight punch thrown with the lead hand, foundational for combinations."
                },
                {
                    "variation": "Cross",
                    "description": "A powerful, straight punch delivered with the rear hand, often follows a jab."
                }
            ]
        },
        {
            "course_name": "CSA Striking System",
            "video_name": "Teeps",
            "focus": "Offensive",
            "types": [
                "Teep",
                "Front Kick",
                "Push Kick"
            ],
            "disciplines": [
                "Muay Thai",
                "MMA"
            ],
            "targets": [
                "Midsection",
                "Head"
            ],
            "strategies": [
                "Utilizing teeps for range control and to maintain distance from the opponent.",
                "Incorporating feints and switch movements to disguise the true intention of the teep, creating openings for further attacks.",
                "Seamlessly integrating teeps into combinations, using them to set up high-impact strikes or to disrupt the opponent's offense."
            ],
            "techniques": [
                {
                    "variation": "Lead Teep",
                    "description": "A direct front kick from the lead leg, used for quick jabs to the opponent's midsection or lower body to maintain or create distance."
                },
                {
                    "variation": "Rear Teep",
                    "description": "Delivered from the back leg, offering more power and used to push the opponent back or off-balance them."
                }
            ]
        }
    ]
}
