{
    "techniques": [
        {
            "video_name": "Course 1: Video 2",
            "course_name": "CSA Striking System",
            "name": "Advanced Punching Number System",
            "description": "Continuation of the basic punching number system, introducing more complex techniques focused on body shots and uppercuts, enhancing offensive capabilities.",
            "offensive": {
                "focus": "Offensive",
                "types": [
                    "Body Shots",
                    "Uppercuts"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Body",
                    "Liver",
                    "Spleen",
                    "Floating Rib"
                ],
                "strategies": {
                    "establishing": "Targeting vital body areas to weaken the opponent and create openings.",
                    "faking": "Mixing body shots with head punches to confuse and break down the opponent's defense.",
                    "combining": "Seamlessly integrating body shots and uppercuts into combinations to maximize damage."
                },
                "techniques": [
                    {
                        "variation": "Left Hook to the Body",
                        "description": "Aiming for the liver with a shovel hook at a 45-degree angle to inflict maximum damage.",
                        "timestamp": "00:17:03-00:19:17"
                    },
                    {
                        "variation": "Right Hook to the Body",
                        "description": "Targeting the spleen or floating ribs from a wider angle to disrupt the opponent's guard and breathing.",
                        "timestamp": "00:19:18-00:21:07"
                    },
                    {
                        "variation": "Left Uppercut",
                        "description": "Delivered to the glove as a practice for precision and to prepare for actual combat situations.",
                        "timestamp": "00:25:17-00:27:24"
                    },
                    {
                        "variation": "Right Uppercut",
                        "description": "Practiced against the glove to ensure accuracy and effectiveness in landing the punch.",
                        "timestamp": "00:28:00-00:29:11"
                    }
                ]
            },
            "defensive": {
                "focus": "Defensive",
                "types": [
                    "Guard Positioning",
                    "Body Movement"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Head",
                    "Body"
                ],
                "strategies": {
                    "establishing": "Maintaining a high guard and proper elbow placement to protect vital areas.",
                    "faking": "Using body movement to dodge or absorb body shots and uppercuts.",
                    "combining": "Counter-attacking post-defensive maneuver to exploit the opponent's temporary vulnerabilities."
                },
                "notes": "Emphasis on the importance of protecting organs such as the liver and spleen during combat, and the technique of guarding against body shots."
            },
            "transcript_reference": "00:00:06:12 - 00:02:28:21",
            "key_points": [
                "Introduction of more advanced techniques to the punching number system, focusing on body shots and uppercuts.",
                "Strategic targeting of the liver, spleen, and floating ribs for offensive strategy.",
                "Defensive strategies include maintaining a tight guard and using body movement to minimize damage from body shots.",
                "Training methods include practicing against gloves to simulate real fighting scenarios and improve precision."
            ]
        }
    ]
}