{
    "techniques": [
        {
            "video_name": "Course 11: Video 3",
            "course_name": "CSA Striking System",
            "name": "Touching Shoulders Sparring Drill",
            "description": "A dynamic sparring drill emphasizing footwork, range management, and striking without head contact. Participants aim to touch each other's shoulders, simulating the precision needed for face strikes. The drill evolves to include leg kicks, body kicks, head kicks, and even spinning techniques, enhancing adaptability and defensive skills.",
            "offensive": {
                "focus": "Precision, Speed, and Adaptability",
                "types": [
                    "Hand Strikes",
                    "Leg Kicks",
                    "Body Kicks",
                    "Head Kicks",
                    "Spinning Techniques"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Shoulders",
                    "Knees"
                ],
                "strategies": {
                    "footwork_and_range": "Utilizing footwork to maintain optimal striking distance.",
                    "fakes_and_feints": "Incorporating fakes and feints to create openings.",
                    "level_changes": "Using level changes to attack and defend effectively."
                },
                "techniques": [
                    {
                        "variation": "Shoulder Touches",
                        "description": "Simulating precision strikes to the face by touching the partner's shoulders.",
                        "timestamp": "00:00:34:17 - 00:00:49:02"
                    },
                    {
                        "variation": "Leg Kicks",
                        "description": "Integrating leg kicks into the drill, focusing on touching the shoulders to simulate high-line attacks.",
                        "timestamp": "00:04:07:01 - 00:04:37:00"
                    },
                    {
                        "variation": "Knees and Elbows",
                        "description": "Adding knees and elbows, encouraging close-range combat simulation.",
                        "timestamp": "00:06:02:09 - 00:06:11:03"
                    }
                ]
            },
            "defensive": {
                "focus": "Evasion, Blocking, and Checking",
                "types": [
                    "Evasion",
                    "Blocking",
                    "Checking Kicks"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "General"
                ],
                "strategies": {
                    "adaptive_defense": "Adjusting defensive techniques based on opponent's attacks.",
                    "range_management": "Managing distance to minimize effective strikes from an opponent.",
                    "counter_strategies": "Developing counters to strikes through effective defense and evasion."
                },
                "notes": "The drill starts with basic shoulder touches and progressively incorporates more complex striking and defensive maneuvers, providing a comprehensive approach to sparring without direct head contact."
            }
        }
    ]
}