{
    "techniques": [
        {
            "video_name": "Course 4: Video 1",
            "course_name": "CSA Striking System",
            "name": "Basic Combos 1-5",
            "description": "Introduction to basic boxing combinations within the CSA striking system, focusing on building a strong foundation for combat sports. These combinations start with a boxing base and can be expanded with Muay Thai techniques such as kicks, elbows, knees, and teeps for more complex strategies.",
            "offensive": {
                "focus": "Offensive",
                "types": [
                    "Striking"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai"
                ],
                "targets": [
                    "Head",
                    "Body"
                ],
                "strategies": {
                    "foundation": "Each combo begins with a strong boxing base, emphasizing push-pull dynamics and alternating between left and right strikes for fluidity.",
                    "expansion": "Combos are designed to incorporate Muay Thai elements around and within the boxing framework, enhancing versatility.",
                    "adaptation": "Body work variations allow each combo to target different levels, ensuring adaptability to opponents' defenses."
                },
                "techniques": [
                    {
                        "variation": "Jab",
                        "description": "The fundamental strike to establish range and begin combinations.",
                        "timestamp": "00:53:15-00:55:11"
                    },
                    {
                        "variation": "Jab-Cross",
                        "description": "Basic two-strike combination to engage and create openings.",
                        "timestamp": "00:55:12-00:56:11"
                    },
                    {
                        "variation": "Jab-Cross-Hook",
                        "description": "Three-strike combo that adds a hook to target the side.",
                        "timestamp": "00:56:13-00:58:08"
                    },
                    {
                        "variation": "Jab-Cross-Hook-Cross",
                        "description": "Four-strike combination that reintroduces the cross for power.",
                        "timestamp": "00:58:09-01:00:07"
                    },
                    {
                        "variation": "Jab-Cross-Hook-Cross-Lead Uppercut",
                        "description": "Five-strike combo ending with an uppercut to lift the opponent's guard.",
                        "timestamp": "01:00:08-01:02:05"
                    }
                ]
            },
            "defensive": {
                "focus": "Defensive",
                "types": [
                    "Counter-Striking",
                    "Positioning"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai"
                ],
                "targets": [
                    "Head",
                    "Body"
                ],
                "strategies": {
                    "repositioning": "Ensures safety after body shots by returning to the head or attacking the leg, or by exiting the exchange zone.",
                    "counter-preparation": "Emphasizes the importance of finishing combinations with strikes that prepare for or prevent counter-attacks."
                },
                "notes": "The ability to fluidly transition between targeting the head and body within combinations enhances the fighter's adaptability and unpredictability."
            },
            "transcript_reference": "00:00:06:11 - 00:02:58:14",
            "key_points": [
                "The basic combos 1-5 serve as the foundational striking framework within the CSA striking system.",
                "Incorporating Muay Thai techniques into boxing combinations increases the effectiveness and complexity of attacks.",
                "Proper execution and strategic follow-up after body shots are critical for maintaining offensive pressure and defensive safety."
            ]
        }
    ]
}