{
    "techniques": [
        {
            "video_name": "Course 11: Video 5",
            "course_name": "CSA Striking System",
            "name": "Isolation Sparring Drills",
            "description": "Isolation sparring drills focus on enhancing specific aspects of a fighter's arsenal by limiting the tools available during sparring. This method encourages fighters to explore and refine all elements of their game, moving beyond reliance on their dominant techniques, such as a powerful rear hand. The drills progress from simple to complex, starting with jabs only and gradually incorporating more techniques.",
            "offensive": {
                "focus": "Diversification of Attack",
                "types": [
                    "Jabs",
                    "Lead Teep",
                    "Lead Round Kick",
                    "All Punches with Lead Hand",
                    "Rear Leg Techniques",
                    "Combination Free Spar with Limited Rear Hand"
                ],
                "disciplines": [
                    "Kickboxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Head",
                    "Body",
                    "Legs"
                ],
                "strategies": {
                    "jab_mastery": "Mastering the use of the jab in various forms including to the head, body, doubling, and tripling.",
                    "lead_teep_utilization": "Employing the lead teep as a versatile tool for control, distance management, and setting up further attacks.",
                    "round_kick_integration": "Incorporating lead round kicks to target different levels, enhancing the fighter's ability to attack fluidly from multiple angles.",
                    "comprehensive_lead_hand": "Utilizing the lead hand for a full range of punches, fostering a well-rounded offensive strategy.",
                    "rear_leg_dynamics": "Exploring the full potential of rear leg techniques without relying on the power rear hand punch, promoting a balanced skill set."
                }
            },
            "defensive": {
                "focus": "Adaptive Defense",
                "types": [
                    "Slip",
                    "Parry",
                    "Catch",
                    "Duck",
                    "Evasion"
                ],
                "disciplines": [
                    "Kickboxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "General"
                ],
                "strategies": {
                    "jab_defense": "Developing defensive responses to the jab, including slipping, parrying, catching, and ducking, to handle the most common strike in combat sports.",
                    "anticipating_attacks": "Learning to read and anticipate attacks based on limited offensive options, enhancing reaction times and defensive decision-making."
                },
                "notes": "The defensive component of isolation sparring drills is crucial for building a fighter's ability to adapt and react to various attacks with limited offensive cues."
            },
            "variations": [
                {
                    "name": "Jab Sparring",
                    "description": "Sparring using only the jab to attack, defend, and counter.",
                    "timestamp": "00:01:25:05 - 00:01:47:07"
                },
                {
                    "name": "Jab and Lead Teep Sparring",
                    "description": "Incorporating the jab and lead teep into sparring, focusing on these two techniques exclusively.",
                    "timestamp": "00:02:39:24 - 00:02:47:15"
                },
                {
                    "name": "Lead Techniques Sparring",
                    "description": "Expanding the arsenal to include all lead hand punches and lead leg kicks, but excluding the rear hand punch.",
                    "timestamp": "00:03:31:04 - 00:03:47:07"
                },
                {
                    "name": "Full Arsenal with Limited Rear Hand",
                    "description": "Free sparring with all weapons available, but with restricted use of the power rear hand, forcing creativity and versatility.",
                    "timestamp": "00:06:30:04 - 00:06:49:08"
                }
            ]
        }
    ]
}