{
    "techniques": [
        {
            "video_name": "Course 11: Video 6",
            "course_name": "CSA Striking System",
            "name": "Situational Sparring Drills",
            "description": "Situational sparring drills are designed to focus on specific aspects of combat by creating scenarios that fighters might encounter against various types of opponents. These drills help in developing strategies and techniques to counter specific styles, enhancing a fighter's adaptability and readiness for a wide range of challenges in the ring.",
            "offensive": {
                "focus": "Adapting to Opponent's Style",
                "types": [
                    "Boxing Only",
                    "Kicks Only",
                    "Boxing vs Kicking",
                    "Offense vs Defense"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Varies based on drill"
                ],
                "strategies": {
                    "boxing_dominance": "Forcing fighters to rely on their boxing skills, enhancing hand speed, combinations, and defensive maneuvers.",
                    "kicking_mastery": "Emphasizing the use of kicks to improve range control, power, and the ability to attack from a distance.",
                    "style_confrontation": "Creating scenarios where boxers confront kickers and vice versa, teaching fighters to exploit their strengths against specific weaknesses.",
                    "defensive_skills": "Developing a fighter's ability to defend against various attacks while looking for counter opportunities."
                }
            },
            "defensive": {
                "focus": "Enhancing Defense Against Specific Attacks",
                "types": [
                    "Blocking",
                    "Evasion",
                    "Footwork",
                    "Counter-Striking"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Varies based on drill"
                ],
                "strategies": {
                    "boxing_defense": "Improving guard, head movement, and counter-punching against boxers.",
                    "kick_defense": "Teaching how to check kicks, maintain distance, and counter with punches or takedowns.",
                    "mixed_approach": "Adapting defensive strategies based on the opponent's chosen style, focusing on minimizing damage while creating openings for counter-attacks."
                },
                "notes": "Defensive components are tailored to address the specific challenges posed by the offensive focus of each situational drill."
            },
            "variations": [
                {
                    "name": "Boxing Only Sparring",
                    "description": "Sparring with the restriction of using only boxing techniques to force hand usage and improve boxing skills.",
                    "timestamp": "00:00:59:06 - 00:01:23:16"
                },
                {
                    "name": "Kicks Only Sparring",
                    "description": "Sparring with the limitation of using only kicks, encouraging fighters to utilize and enhance their kicking abilities.",
                    "timestamp": "00:01:25:04 - 00:01:44:03"
                },
                {
                    "name": "Boxing vs Kicking Sparring",
                    "description": "One fighter is restricted to boxing while the other can only use kicks, focusing on the interplay between different ranges and styles.",
                    "timestamp": "00:03:37:18 - 00:04:31:25"
                },
                {
                    "name": "Offense vs Defense Sparring",
                    "description": "One fighter focuses exclusively on offense, while the other adopts a defensive approach, enhancing both attack and defense skills.",
                    "timestamp": "00:05:29:09 - 00:06:27:24"
                },
                {
                    "name": "Orthodox vs Southpaw Sparring",
                    "description": "Sparring sessions that emphasize the dynamic between orthodox and southpaw fighters, highlighting the importance of stance-specific strategies.",
                    "timestamp": "00:07:54:10 - 00:08:57:22"
                }
            ]
        }
    ]
}