{
    "techniques": [
        {
            "video_name": "Course 8: Video 1",
            "course_name": "CSA Striking System",
            "name": "Parry Range Control and Basic Boxing Counters",
            "description": "Focuses on the importance of controlling parry range for defensive and offensive efficiency in striking. Demonstrates a fundamental parry drill with Muay Thai champions Desiree Wodicker and LAL Chaffi, emphasizing the ability to read and react within parry range. The drill includes basic boxing counters (jab, cross, hook, overhand, and uppercut) following a parry, illustrating how maintaining proper range allows for immediate access to all striking tools.",
            "offensive": false,
            "defensive": {
                "focus": "Defensive and Counter-Offensive",
                "types": [
                    "Parrying",
                    "Boxing Counters"
                ],
                "disciplines": [
                    "Muay Thai",
                    "MMA",
                    "Boxing"
                ],
                "targets": [
                    "Opponent's Strikes"
                ],
                "strategies": {
                    "controlling_parry_range": "Maintaining a distance that allows for effective parrying and countering, enabling fighters to read and react to opponents' moves.",
                    "jab_counter": "Parrying the opponent's jab and countering with one's own jab.",
                    "cross_counter": "Following a parry with a cross to exploit the opening created by the defensive move.",
                    "hook_counter": "Using a hook as a counterattack after successfully parrying an incoming strike.",
                    "overhand_counter": "Countering with an overhand right after parrying, capitalizing on the opponent's exposed position.",
                    "uppercut_counter": "Executing an uppercut in response to a parry, targeting vulnerabilities in the opponent's guard."
                },
                "techniques": [
                    {
                        "variation": "Jab Parry and Counter",
                        "description": "Parrying the opponent's jab and immediately countering with a jab, cross, hook, overhand, or uppercut.",
                        "timestamp": "00:31:06-00:51:15"
                    },
                    {
                        "variation": "Cross Parry and Counter",
                        "description": "Deflecting the opponent's cross and countering with a strategically chosen punch from the fighter's arsenal.",
                        "timestamp": "00:51:16-01:00:03"
                    }
                ]
            },
            "transcript_reference": "00:00:06:14 - 00:04:51:01",
            "key_points": [
                "Controlling parry range is crucial for defensive effectiveness and offensive readiness in a fight.",
                "Proper parry and counter techniques allow fighters to exploit openings in their opponent's defense.",
                "The drill emphasizes the importance of reaction time and visual acuity in fighting, highlighting the defensive and counter-offensive capabilities within parry range.",
                "Adaptable to various combat sports, including Muay Thai, MMA, and boxing, showcasing the universal application of the drill.",
                "Encourages fighters to incorporate a variety of punches in their counters, enhancing versatility and unpredictability in combat."
            ]
        }
    ]
}