{
    "techniques": [
        {
            "video_name": "Course 2: Video 4",
            "course_name": "CSA Striking System",
            "name": "Teeps",
            "description": "Explores the six basic teep techniques within the CSA striking system, emphasizing their versatility and strategic application in combat sports. This segment underlines the importance of foot positioning, hip extension, and active defense for effective teep execution.",
            "offensive": {
                "focus": "Offensive",
                "types": [
                    "Teep",
                    "Front Kick",
                    "Push Kick"
                ],
                "disciplines": [
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Midsection",
                    "Head"
                ],
                "strategies": {
                    "establishing": "Utilizing teeps for range control and to maintain distance from the opponent.",
                    "faking": "Incorporating feints and switch movements to disguise the true intention of the teep, creating openings for further attacks.",
                    "combining": "Seamlessly integrating teeps into combinations, using them to set up high-impact strikes or to disrupt the opponent's offense."
                },
                "techniques": [
                    {
                        "variation": "Lead Teep",
                        "description": "A direct front kick from the lead leg, used for quick jabs to the opponent's midsection or lower body to maintain or create distance.",
                        "timestamp": "00:30:08-00:32:13"
                    },
                    {
                        "variation": "Rear Teep",
                        "description": "Delivered from the back leg, offering more power and used to push the opponent back or off-balance them.",
                        "timestamp": "00:33:17-00:36:05"
                    },
                    {
                        "variation": "Switch Teep",
                        "description": "Involves a quick stance switch to deliver a teep with what was originally the rear leg, creating an element of surprise.",
                        "timestamp": "00:36:06-00:38:11"
                    },
                    {
                        "variation": "Fake Lead, Throw Rear Teep",
                        "description": "A deceptive move where a lead teep is faked to draw a reaction, followed by a solid rear teep.",
                        "timestamp": "00:38:12-00:41:02"
                    },
                    {
                        "variation": "Thai Hop Teep",
                        "description": "Utilizes a small hop to generate additional forward momentum and power for the teep.",
                        "timestamp": "00:41:03-00:43:00"
                    },
                    {
                        "variation": "Jump Teep",
                        "description": "An advanced technique where the practitioner jumps to deliver a more powerful and dynamic teep, potentially targeting the head.",
                        "timestamp": "00:43:01-00:45:07"
                    }
                ]
            },
            "defensive": {
                "focus": "Defensive",
                "types": [
                    "Distance Management",
                    "Disruption"
                ],
                "disciplines": [
                    "Muay Thai",
                    "MMA"
                ],
                "targets": [
                    "Midsection",
                    "Head"
                ],
                "strategies": {
                    "establishing": "Using teeps defensively to control the fighting range and to prevent the opponent from closing in.",
                    "faking": "Employing feints and fakes to disrupt the opponent's attack patterns and to create counter-attacking opportunities.",
                    "combining": "Integrating defensive teeps with evasive movements and guards to enhance overall defensive capabilities."
                },
                "notes": "Emphasizes the importance of active defense while executing teeps, including maintaining a stable base and being mindful of potential counters."
            },
            "transcript_reference": "00:00:06:10 - 00:03:45:13",
            "key_points": [
                "Comprehensive overview of six fundamental teep techniques and their applications in striking strategies.",
                "Highlights the significance of proper foot positioning, hip extension, and shoulder alignment for effective teep execution.",
                "Discusses variations in teep techniques, including the switch teep and thai hop teep, to enhance unpredictability in combat.",
                "Underlines the tactical use of teeps for distance control, opponent disruption, and setting up powerful combinations."
            ]
        }
    ]
}