{
    "techniques": [
        {
            "video_name": "Course 9: Video 7",
            "course_name": "CSA Striking System",
            "name": "Level Change Combos: High Low, Whost, and Levels",
            "description": "This segment introduces strategies for attacking multiple body levels to create openings and capitalize on opponent reactions. It features four primary combo variables: High Low, High Low 2, Whost, and Levels, each designed to mix up the height of attacks from head to body to legs, encouraging fighters to adapt these patterns during fights for effective striking.",
            "offensive": {
                "focus": "Offensive",
                "types": [
                    "Jabs",
                    "Crosses",
                    "Hooks",
                    "Body Shots",
                    "Leg Kicks"
                ],
                "disciplines": [
                    "Muay Thai",
                    "MMA",
                    "Kickboxing"
                ],
                "targets": [
                    "Head",
                    "Body",
                    "Legs"
                ],
                "strategies": {
                    "mixing_heights": "Varying attack levels to confuse and break down opponents' defenses, using combinations that target the head, body, and legs.",
                    "high_low": "Implementing combos that start high to draw the guard up, then attack low to exploit gaps in the defense, and vice versa.",
                    "Whost": "A specific combo pattern emphasizing a powerful body shot followed by a leg kick, named in honor of Ernesto Hoost.",
                    "levels": "A strategic approach to hit all three levels in quick succession, maximizing damage and opening opportunities for decisive strikes."
                },
                "techniques": [
                    {
                        "variation": "High Low",
                        "description": "A combo that starts with a jab to the head, crosses to the body, hooks to the head, and finishes with a leg chop.",
                        "timestamp": "00:01:12:17-00:01:19:18"
                    },
                    {
                        "variation": "High Low 2",
                        "description": "An alternative high-low combo with a jab to the head, cross to the head, jab to the body, and finishes with a cross to the head and a liver shot.",
                        "timestamp": "00:01:22:13-00:01:27:19"
                    },
                    {
                        "variation": "Whost",
                        "description": "Named after Ernesto Hoost, this combo involves a jab and cross to the head, followed by a rip to the body and a leg chop.",
                        "timestamp": "00:01:49:16-00:01:55:12"
                    },
                    {
                        "variation": "Levels",
                        "description": "Targets all three levels starting with a hook to the head, a leg chop, a cross to the head, a liver kick, and finishes with a jab to the head.",
                        "timestamp": "00:01:56:21-00:02:03:07"
                    }
                ]
            },
            "defensive": {
                "focus": "Defensive",
                "types": [
                    "Guarding",
                    "Movement"
                ],
                "disciplines": [
                    "Muay Thai",
                    "MMA",
                    "Kickboxing"
                ],
                "targets": [
                    "General"
                ],
                "strategies": {
                    "reaction_to_level_changes": "Improving defensive reactions to attacks at varying heights to protect against high-low combos and maintain guard efficiency.",
                    "anticipating_combinations": "Developing the ability to anticipate and defend against complex combinations that target multiple body levels."
                },
                "notes": "Stresses the importance of adaptability in defense, adjusting guard and movement in response to the opponent's changing attack patterns."
            },
            "transcript_reference": "00:00:06:08 - 00:02:34:09",
            "key_points": [
                "Demonstrates the effectiveness of varying attack levels to create openings and land successful strikes.",
                "Introduces specific combo patterns designed to exploit opponent's defensive weaknesses by attacking the head, body, and legs in quick succession.",
                "Highlights the strategic value of mixing attack heights in combos, encouraging fighters to implement these patterns for increased fight IQ and versatility."
            ]
        }
    ]
}