{
    "techniques": [
        {
            "video_name": "Course 9: Video 1",
            "course_name": "CSA Striking System",
            "name": "Progressive Combos in Striking",
            "description": "Introduces progressive combinations as a versatile training tool for enhancing striking skills. These combos allow fighters to build sequences progressively, adding layers of complexity. The focus is on increasing volume and intensity to simulate fight conditions, improving fighters' ability to execute longer combinations fluidly in actual combat scenarios.",
            "offensive": {
                "focus": "Offensive",
                "types": [
                    "Punches",
                    "Kicks"
                ],
                "disciplines": [
                    "Muay Thai",
                    "Kickboxing",
                    "MMA"
                ],
                "targets": [
                    "Head",
                    "Body",
                    "Legs"
                ],
                "strategies": {
                    "volume_training": "Employing progressively longer combinations to increase a fighter's output and endurance.",
                    "attack_diversification": "Mixing strikes to various targets (head, body, legs) within combos to create unpredictable attack patterns.",
                    "intensity_scaling": "Gradually increasing the force and speed of strikes within the combo as proficiency improves, simulating real fight intensity."
                },
                "techniques": [
                    {
                        "variation": "Basic Progressive Combo",
                        "description": "Starts with a simple jab to the head, progressively adding crosses to the body, hooks to the head, leg chops, and finishing with a body kick. Each step adds a new element, building a complex striking sequence.",
                        "timestamp": "00:02:23:15-00:03:08:10"
                    }
                ]
            },
            "defensive": false,
            "transcript_reference": "00:00:06:11 - 00:05:13:12",
            "key_points": [
                "Progressive combos train fighters to increase their striking volume and improve sequence memorization under pressure.",
                "The structure of progressive combos facilitates a comprehensive approach to striking, covering all major targets and strike types.",
                "By simulating high-output scenarios, fighters develop the endurance and skill to execute complex attack patterns in actual fights.",
                "The flexibility of progressive combos allows for adaptation to any striking discipline and can be practiced solo on bags or with partners using pads."
            ]
        }
    ]
}