{
    "techniques": [
        {
            "video_name": "Course 7: Video 4",
            "course_name": "CSA Striking System",
            "name": "14 Point Cover Drill with Counters",
            "description": "Expands on the 14 Point Cover Drill by integrating counter-attack options, enhancing the drill's applicability to real combat situations. This section demonstrates how to seamlessly transition from defensive maneuvers such as slips, ducks, and blocks to offensive counters including punches and kicks, embodying a comprehensive approach to both defense and offense in striking.",
            "offensive": false,
            "defensive": {
                "focus": "Integrated Defense and Offense",
                "types": [
                    "Slips",
                    "Ducks",
                    "Blocks",
                    "Counters"
                ],
                "disciplines": [
                    "Boxing",
                    "Muay Thai"
                ],
                "targets": [
                    "Head",
                    "Body"
                ],
                "strategies": {
                    "slip_to_counter": "Utilizes the momentum from slipping punches to launch powerful counterattacks.",
                    "duck_to_counter": "Employs ducking motions to evade and immediately follow up with counters.",
                    "block_to_counter": "Incorporates blocking techniques that set up counter strikes, emphasizing the transition from defense to offense."
                },
                "techniques": [
                    {
                        "variation": "Slip and Counter with Cross-Hook-Cross",
                        "description": "After slipping a jab or cross, a counter combination of cross-hook-cross is deployed, utilizing the loaded power from the defensive move.",
                        "timestamp": "00:32:04-00:35:09"
                    },
                    {
                        "variation": "Duck and Counter with Hook-Cross-Hook",
                        "description": "Following a duck under a punch, a counter with hook-cross-hook takes advantage of the opponent's exposed position.",
                        "timestamp": "00:51:06-00:52:22"
                    },
                    {
                        "variation": "Block and Counter with Opposite Kick",
                        "description": "A defensive block against a body or head strike is immediately followed by a counter kick from the opposite side, showcasing versatility in attack.",
                        "timestamp": "01:16:02-01:18:07"
                    }
                ]
            },
            "transcript_reference": "00:00:06:10 - 00:05:15:09",
            "key_points": [
                "The drill emphasizes the fluid transition between defensive maneuvers and offensive counters, enhancing fight IQ and adaptability.",
                "Counters are tailored to follow the natural momentum and positioning created by defensive actions, ensuring efficiency and power.",
                "Incorporates a variety of striking techniques, allowing for a versatile approach to combat that can adapt to different fighting styles and situations.",
                "The structured approach to integrating offense and defense serves as an effective training methodology for fighters at all levels."
            ]
        }
    ]
}